dependencies/OpenFOAM/tutorials/multiphase/overInterDyMFoam/floatingBody/background/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------
